app/controllers/chats_controller.rb

	def create

		if params[:chat][:sender_id].to_i != current_user.id  		# The below code is for the scenario when the user2 has invited user1 and in the frienship
																	# database the entry is like 10 , 9 . Now when 9 sends the message the link on send message take the
																	# sender and receiver ids from frienships table where in out case the entry is 10 ,9 . And therefore
																	# the entry in the chat table will be created wrong as 10 , 9 while it should be 9,10. So , here we
																	# have checked whether the sender id in params hash is the current user or not . If not , we have
																	# changed it by assigning the correct interchanged value of id in idr.

				params[:chat][:receiver_id] = params[:chat][:sender_id]

		end


		@msg=Chat.new

		@msg.sender_id = current_user.id
		@msg.receiver_id = params[:chat][:receiver_id]
		@msg.text = params[:chat][:text]

		if @msg.save
---
INSERT INTO "chats" ("sender_id", "receiver_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sender_id", 2], ["receiver_id", 1], ["text", "hi khadija ... huzefa here "], ["created_at", "2015-11-07 14:50:45.641855"], ["updated_at", "2015-11-07 14:50:45.641855"]]